app/Http/Controllers/Dat/HomeController.php

    public function index()
    {
        $theloai = TheLoai::all();
        $truyens = Truyen::get()->sortByDesc('LuotXem')->take(8);
        $truyenmois = DB::table('Chuong')
            ->join('Truyen', 'Chuong.MaTruyen', '=', 'Truyen.id')
            ->select('Truyen.*', 'Chuong.*')
            ->orderByDesc('Chuong.id')
            ->take(8)
            ->get();
        // danh gia cao
        $danhgiacaos = Truyen::get()->sortByDesc('DanhGiaTB')->take(8);
        // moi danh gia
        $danhgiamois = DB::table('binhluan')
            ->join('Truyen', 'binhluan.MaTruyen', '=', 'Truyen.id')
            ->join('users', 'binhluan.MaNguoiDung', '=', 'users.id')
            ->select('Truyen.*', 'binhluan.*', 'users.*')
            ->orderByDesc('binhluan.id')
            ->take(4)
            ->get();
---
select * from `TheLoai`
select * from `Truyen`
select `Truyen`.*, `Chuong`.* from `Chuong` inner join `Truyen` on `Chuong`.`MaTruyen` = `Truyen`.`id` order by `Chuong`.`id` desc limit 8
select * from `Chuong`
select `Truyen`.*, `binhluan`.*, `users`.* from `binhluan` inner join `Truyen` on `binhluan`.`MaTruyen` = `Truyen`.`id` inner join `users` on `binhluan`.`MaNguoiDung` = `users`.`id` order by `binhluan`.`id` desc limit 4
select `Truyen`.*, `binhluan`.* from `truyen` inner join `binhluan` on `binhluan`.`MaTruyen` = `Truyen`.`id` order by `binhluan`.`id` desc limit 4